{
  "ADU": "Accessory Dwelling Unit — a smaller secondary housing unit on the same lot as a primary residence (e.g., garage apartment, in-law suite, backyard cottage)",
  "AMI": "Area Median Income — the midpoint household income for the Portsmouth-Rochester metropolitan area, set annually by HUD. Used to define affordability tiers (e.g., 80% AMI means a household earning 80% of the area's median income)",
  "BRAC": "Base Realignment and Closure — federal process that closed Pease Air Force Base; deed covenants from BRAC may restrict land uses",
  "CDBG": "Community Development Block Grant — federal HUD program providing annual funding to cities for housing and community development",
  "CDC": "Community Development Corporation — nonprofit organization focused on housing and economic development in a specific community",
  "CDFI": "Community Development Financial Institution — specialized lender focused on serving low-income communities",
  "CLT": "Community Land Trust — nonprofit that owns land permanently and sells or leases homes on it, keeping housing affordable through resale restrictions",
  "CUP": "Conditional Use Permit — a zoning approval that allows a use not permitted by right, subject to board review and conditions",
  "FBC": "Form-Based Code — a zoning approach that regulates building form (height, setbacks, design) rather than use (residential, commercial)",
  "GBCC": "Great Bay Community College — two-year college with a campus at Pease Tradeport in Portsmouth",
  "GNOD": "Gateway Neighborhood Overlay District — Portsmouth zoning overlay allowing higher-density mixed-use development with workforce housing incentives",
  "HAP": "Housing Action Plan — the comprehensive plan this brainstorm is designed to inform",
  "HDC": "Historic District Commission — local board that reviews changes to properties in Portsmouth's historic districts",
  "HUD": "U.S. Department of Housing and Urban Development — federal agency overseeing housing programs and fair housing enforcement",
  "IZ": "Inclusionary Zoning — policy requiring or incentivizing developers to include affordable units in new housing projects",
  "LIHTC": "Low-Income Housing Tax Credit — the most powerful federal tool for financing affordable housing construction; developers receive tax credits in exchange for building and maintaining affordable units",
  "MFTE": "Multifamily Tax Exemption — a tax incentive program that exempts qualifying multifamily housing from property taxes for a defined period",
  "NOAH": "Naturally Occurring Affordable Housing — rental housing that is affordable due to age, condition, or location rather than subsidy or deed restriction",
  "NHHFA": "New Hampshire Housing Finance Authority — state agency that finances and promotes affordable housing",
  "O/R": "Office/Research — a Portsmouth zoning district originally designed for office and research uses",
  "PDA": "Pease Development Authority — the quasi-governmental body that manages the former Pease Air Force Base",
  "PHA": "Portsmouth Housing Authority — the local public housing authority that develops and manages affordable housing",
  "POAH": "Preservation of Affordable Housing — national nonprofit that partners with local housing authorities on affordable housing development",
  "PUD": "Planned Unit Development — a zoning tool allowing flexible site design in exchange for public benefits",
  "RKG": "RKG Associates — the consulting firm that authored Portsmouth's 2022 Housing Market Study",
  "RSA": "Revised Statutes Annotated — New Hampshire's compiled state laws (e.g., RSA 674 covers planning and zoning)",
  "RSA 79-E": "Community Revitalization Tax Relief Incentive — NH law allowing municipalities to grant temporary tax relief on improvements to qualifying buildings in designated areas",
  "STR": "Short-Term Rental — housing units rented for periods shorter than 30 days (e.g., Airbnb, VRBO)",
  "TIF": "Tax Increment Financing — a tool that captures increased property tax revenue from new development within a defined district to fund infrastructure improvements in that district",
  "TOD": "Transit-Oriented Development — higher-density housing and mixed-use development concentrated near transit stops or corridors",
  "ZBA": "Zoning Board of Adjustment — local board that hears variance requests and appeals of zoning decisions",
  "R / SRA / SRB": "Residential / Single Residence A / Single Residence B — Portsmouth's three single-family-only zones totaling 2,276 acres (85.8% of residential land). R zone: 498 acres, 5-acre minimum. SRA: 589 acres, 1-acre minimum. SRB: 1,189 acres, 15,000 sf minimum.",
  "GRA / GRB / GRC": "General Residence A / B / C — Portsmouth's three zones that allow multifamily housing, totaling 375 acres (14.2% of residential land). These zones generate 5.71x more tax revenue per acre than single-family zones.",
  "GIS": "Geographic Information System — computerized mapping and analysis of property, land use, and geographic data. Used to analyze zoning patterns, parcel characteristics, and development capacity across Portsmouth."
}